      *PROGRAMA HOLA MUNDO.
       IDENTIFICATION DIVISION.
           PROGRAM-ID. HOLAM.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
           DISPLAY 'HOLA MUNDO'.
       STOP RUN.
