       IDENTIFICATION DIVISION.
       PROGRAM-ID. ID-SEC.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPLEADO ASSIGN TO 'C:\Users\pc\Desktop\S\secu'.
       DATA DIVISION.
       FILE SECTION.
       FD EMPLEADO.
       01 REG-EMPL.
           05 ID-EMPL PIC 9(02).
           05 NOM-EMPL PIC X(20).
           05 NOM-DEP  PIC X(10) VALUE SPACES.
           05 S-MEN    PIC 9(05) VALUE ZERO.
           05 F-ING    PIC 9(08) VALUE ZERO.



       WORKING-STORAGE SECTION.
       01 WS-FLAG1 PIC X.
       01 WS-FLAG  PIC 9 VALUE 0.
       01 WS-RES   PIC 9(02).

       01 WS-ID-EMPL PIC 9(02).

       PROCEDURE DIVISION.
      *INICIAMOS EL PROCESO ABRIENDO ARCHIVO HASTA 101 MAS.
       001-INI.
           PERFORM 100-ABRIR.
           PERFORM 100-ID.
           PERFORM 100-CONSULTA UNTIL WS-ID-EMPL = 99.
           PERFORM 101-MAS UNTIL WS-ID-EMPL = 99.

           STOP RUN.

       100-ABRIR.
           OPEN INPUT EMPLEADO.
       101-CERRAR.
           CLOSE EMPLEADO.

       100-ID.
           DISPLAY 'ID'
           ACCEPT WS-ID-EMPL.
           IF WS-ID-EMPL EQUAL 99
               PERFORM 101-CERRAR.

       100-CONSULTA.
           READ EMPLEADO AT END CLOSE EMPLEADO
           PERFORM 101-MAS.
           IF WS-ID-EMPL = ID-EMPL
               DISPLAY REG-EMPL.

       101-MAS.
       OPEN INPUT EMPLEADO PERFORM 100-ID.
